Designed UI for README
